Revit 2027 API
ViewportRotation Enumeration
 Rotation of the viewport
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ViewportRotation
Public Enumeration ViewportRotation
public enum class ViewportRotation
type ViewportRotation
Members
Member name | Value | Description
Clockwise | 1 |  Viewport is rotated 90 degrees clockwise.
Counterclockwise | 2 |  Viewport is rotated 90 degrees counterclockwise.
None | 0 |  Viewport is not rotated.
See Also
Reference
Autodesk.Revit.DB Namespace